{
  "version": "3.1",
  "schema_note": "Single source of truth for the 9 canonical Guardian Laws. G10/G11 moved to config/personas.yml as agent personas — they are NOT Guardian Laws.",
  "math_note": "D^162 = P^3 (Trinity) x H^6 (Hexagon stages) x G^9 (Guardian Laws). This equation is immutable.",
  "weight_map": {
    "CRITICAL": 10,
    "HIGH": 2,
    "MEDIUM": 1
  },
  "deny_weighted_threshold": 4,
  "hexagon_note": "6 Hexagon stages (Inventory, Empathy, Process, Debate, Healing, Action) are pipeline steps — NOT guardians.",
  "trinity_note": "3 Trinity perspectives (Material, Intellectual, Essential) are a D^162 axis — NOT guardians.",
  "persona_note": "Operational personas (Librarian, SAP, Auditor, Sentinel, Architect, Healer, Amplifier, BoosterLever, Chronos, Evolution, RelationalCare, Glos Krytyka, Archetyp Harmonii, ...) are defined in config/personas.yml. They operate WITHIN this matrix — they never modify it.",
  "laws": [
    {
      "id": "G1",
      "name": "Unity",
      "runtime_name": "Unity",
      "severity": "MEDIUM",
      "persona": "Librarian",
      "description": "All actions must serve system coherence",
      "threshold": 0.87
    },
    {
      "id": "G2",
      "name": "Harmony",
      "runtime_name": "Harmony",
      "severity": "MEDIUM",
      "persona": "SAP",
      "description": "Balance competing objectives; genuine analysis",
      "threshold": 0.87
    },
    {
      "id": "G3",
      "name": "Rhythm",
      "runtime_name": "Rhythm",
      "severity": "MEDIUM",
      "persona": "Auditor",
      "description": "Maintain consistent cadence and timing of operations",
      "threshold": 0.87
    },
    {
      "id": "G4",
      "name": "Causality",
      "runtime_name": "Causality",
      "severity": "HIGH",
      "persona": "Sentinel",
      "description": "Every action must have a traceable, justified cause",
      "threshold": 0.87
    },
    {
      "id": "G5",
      "name": "Transparency",
      "runtime_name": "Transparency",
      "severity": "MEDIUM",
      "persona": "Architect",
      "description": "All decisions and reasoning must be visible and auditable",
      "threshold": 0.87
    },
    {
      "id": "G6",
      "name": "Authenticity",
      "runtime_name": "Authenticity",
      "severity": "HIGH",
      "persona": "Healer",
      "description": "Outputs must be genuine and free from deception; LLM output non-frozen",
      "threshold": 0.87
    },
    {
      "id": "G7",
      "name": "Privacy",
      "runtime_name": "Privacy",
      "severity": "CRITICAL",
      "persona": "system-wide",
      "description": "All data remains local; no unsolicited contact without consent",
      "threshold": 0.95,
      "veto": true
    },
    {
      "id": "G8",
      "name": "Nonmaleficence",
      "runtime_name": "Nonmaleficence",
      "severity": "CRITICAL",
      "persona": "system-wide",
      "description": "Never cause harm; do not bid outside fair budget range",
      "threshold": 0.95,
      "veto": true
    },
    {
      "id": "G9",
      "name": "Sustainability",
      "runtime_name": "Sustainability",
      "severity": "HIGH",
      "persona": "system-wide",
      "description": "Operate within resource limits and preserve long-term system health",
      "threshold": 0.87
    }
  ],
  "immutability_note": "These 9 laws are the floor, not the ceiling. The agent swarm may grow to 34+ personas. Laws do not grow — they remain 9."
}
