{
  "version": "3.0",
  "schema_note": "Single source of truth for all Guardian Laws. G1-G9 canonical (D^162 math). G10-G11 runtime extensions.",
  "math_note": "D^162 = P^3 (Trinity) x H^6 (Hexagon stages) x G^9 (Guardian Laws). Trinity and Hexagon are NOT guardians.",
  "weight_map": {
    "CRITICAL": 10,
    "HIGH": 2,
    "MEDIUM": 1
  },
  "deny_weighted_threshold": 4,
  "hexagon_note": "6 Hexagon stages (Inventory, Empathy, Process, Debate, Healing, Action) are pipeline steps — NOT guardians. Previously mislabelled as '6 Guardian Personas'.",
  "trinity_note": "3 Trinity perspectives (Material, Intellectual, Essential) are a separate D^162 axis — NOT guardians.",
  "laws": [
    {
      "id": "G1",
      "name": "Unity",
      "runtime_name": "Unity",
      "severity": "MEDIUM",
      "persona": "Librarian",
      "description": "All actions must serve system coherence",
      "threshold": 0.87
    },
    {
      "id": "G2",
      "name": "Harmony",
      "runtime_name": "Harmony",
      "severity": "MEDIUM",
      "persona": "SAP",
      "description": "Balance between competing objectives; analysis must be genuine",
      "note": "runtime_name was 'Truth' in v2.0 — corrected",
      "threshold": 0.87
    },
    {
      "id": "G3",
      "name": "Rhythm",
      "runtime_name": "Rhythm",
      "severity": "MEDIUM",
      "persona": "Auditor",
      "description": "Maintain consistent cadence and timing of operations",
      "threshold": 0.87
    },
    {
      "id": "G4",
      "name": "Causality",
      "runtime_name": "Causality",
      "severity": "HIGH",
      "persona": "Sentinel",
      "description": "Every action must have a traceable, justified cause",
      "threshold": 0.87
    },
    {
      "id": "G5",
      "name": "Transparency",
      "runtime_name": "Transparency",
      "severity": "MEDIUM",
      "persona": "Architect",
      "description": "All decisions and reasoning must be visible and auditable",
      "threshold": 0.87
    },
    {
      "id": "G6",
      "name": "Authenticity",
      "runtime_name": "Authenticity",
      "severity": "HIGH",
      "persona": "Healer",
      "description": "Outputs must be genuine and free from deception; LLM output non-frozen",
      "note": "runtime_name was 'Nonmaleficence' in v2.0 (bug). Implemented as _law_authenticity() since v4.0.",
      "threshold": 0.87
    },
    {
      "id": "G7",
      "name": "Privacy",
      "runtime_name": "Privacy",
      "severity": "CRITICAL",
      "persona": "system-wide",
      "description": "All data remains local; no unsolicited contact without consent",
      "note": "runtime_name was 'Autonomy' in v2.0 — corrected",
      "threshold": 0.95,
      "veto": true
    },
    {
      "id": "G8",
      "name": "Nonmaleficence",
      "runtime_name": "Nonmaleficence",
      "severity": "CRITICAL",
      "persona": "system-wide",
      "description": "Never cause harm; do not bid outside fair budget range",
      "note": "runtime_name was 'Justice' in v2.0 — corrected",
      "threshold": 0.95,
      "veto": true
    },
    {
      "id": "G9",
      "name": "Sustainability",
      "runtime_name": "Sustainability",
      "severity": "HIGH",
      "persona": "system-wide",
      "description": "Operate within resource limits and preserve long-term system health",
      "threshold": 0.87
    }
  ],
  "runtime_extensions": {
    "note": "G10-G11 active in guardian.py but outside canonical 9. Do not affect 162D tensor product. Candidates for future D^198 = 3x6x11.",
    "laws": [
      {
        "id": "G10",
        "name": "Evolution",
        "runtime_name": "Evolution",
        "severity": "HIGH",
        "description": "Errors drive improvement; PME feedback loops active",
        "added_in": "v4.0"
      },
      {
        "id": "G11",
        "name": "RelationalCare",
        "runtime_name": "RelationalCare",
        "severity": "MEDIUM",
        "description": "Respect user attention budget; EBDI Arousal threshold transparency",
        "added_in": "v4.0"
      }
    ]
  }
}
